ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cyhal_sdhc.c
/* List of available SDHC instances */
static SDHC_Type * const CYHAL_SDHC_BASE_ADDRESSES[CY_IP_MXSDHC_INSTANCES] =
{
#ifdef SDHC0
    SDHC0,
#endif /* ifdef SDHC0 */

#ifdef SDHC1
    SDHC1,
#endif /* ifdef SDHC1 */
};

/* List of available SDHC HF clocks */
static uint8_t const CYHAL_SDHC_HF_CLOCKS[CY_IP_MXSDHC_INSTANCES] =
{
#ifdef SDHC0
    4,
#endif /* ifdef SDHC0 */

#ifdef SDHC1
    2,
#endif /* ifdef SDHC1 */
};


/* List of available SDHC interrupt sources */
static IRQn_Type const CYHAL_SDHC_IRQ_N[CY_IP_MXSDHC_INSTANCES] =
{
#ifdef SDHC0
    sdhc_0_interrupt_general_IRQn,
#endif /* ifdef SDHC0 */

#ifdef SDHC1
    sdhc_1_interrupt_general_IRQn,
#endif /* ifdef SDHC1 */
};

static uint8_t cyhal_sd_get_block_from_irqn(IRQn_Type irqn)
{
    switch (irqn)
    {
#if (CY_CPU_CORTEX_M4)
    #if (CY_IP_MXSDHC_INSTANCES > 0)
        case sdhc_0_interrupt_general_IRQn: return 0;
    #endif

    #if (CY_IP_MXSDHC_INSTANCES > 1)
        case sdhc_1_interrupt_general_IRQn: return 1;
    #endif

    #if (CY_IP_MXSDHC_INSTANCES > 2)
        #error "Unhandled SDHC count"
    #endif
#endif /* (CY_CPU_CORTEX_M4) */
    default:
        CY_ASSERT(false); /* Should never be called with a non-SDHC IRQn */
        return 0;
    }
}

static void *cyhal_sd_config_structs[CY_IP_MXSDHC_INSTANCES];

static void release_pin_if_used(cyhal_gpio_t *pin)
{
    if (CYHAL_NC_PIN_VALUE != *pin)
    {
        cyhal_utils_disconnect_and_free(*pin);
        *pin = CYHAL_NC_PIN_VALUE;
    }
}

static cy_rslt_t setup_pin(cyhal_gpio_t pin, const cyhal_resource_pin_mapping_t *pinmap, size_t count, cyhal_gpio_t *objRef)
{
    cyhal_resource_inst_t pin_rsc = cyhal_utils_get_gpio_resource(pin);
    cy_rslt_t result = cyhal_hwmgr_reserve(&pin_rsc);
    
    if (result == CY_RSLT_SUCCESS)
    {
        const cyhal_resource_pin_mapping_t *map = cyhal_utils_get_resource(pin, pinmap, count);

        if (map == NULL)
        {
            result = CYHAL_SDHC_RSLT_ERR_PIN;
        }

        if (result == CY_RSLT_SUCCESS)
        {
            result = cyhal_connect_pin(map);
        }

        if (result == CY_RSLT_SUCCESS)
        {
            *objRef = pin;
        }
        else
        {
            cyhal_hwmgr_free(&pin_rsc);
        }
    }

    return result;
}

/* Internal global variable to indicate pending sdio async status */
static bool isTransferInProcess = false;

/* Internal functions */
static cy_en_sd_host_status_t Cy_SD_Host_PollTransferComplete(SDHC_Type *base, const uint16_t delay);
static cy_en_sd_host_status_t Cy_SD_Host_PollCmdComplete(SDHC_Type *base);
static cy_en_sd_host_status_t Cy_SD_Host_SdCardChangeClock(SDHC_Type *base, uint32_t instance_num, uint32_t frequency);
static cy_en_sd_host_bus_width_t convert_buswidth(uint8_t stopbits);
static cy_en_syspm_status_t cyhal_sdio_syspm_callback(cy_stc_syspm_callback_params_t *params,
                                                      cy_en_syspm_callback_mode_t mode);

/*******************************************************************************
*       Deep Sleep Callback Service Routine
*******************************************************************************/
static cy_en_syspm_status_t cyhal_sdio_syspm_callback(cy_stc_syspm_callback_params_t *params,
                                                      cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_FAIL;
    cyhal_sdio_t *obj = params->context;
    static bool wasCheckReadyExecuted = false;

    cy_stc_syspm_callback_params_t pdl_params =
    {
        .base = obj->base,
        .context = &(obj->context)
    };

    retVal = Cy_SD_Host_DeepSleepCallback(&pdl_params, mode);

    if (retVal == CY_SYSPM_SUCCESS)
    {
        switch (mode)
        {
            case CY_SYSPM_CHECK_READY:
            {
                cyhal_sdio_event_callback_t callback = (cyhal_sdio_event_callback_t) obj->callback_data.callback;
                if ((callback != NULL) && (0U != (obj->events & (uint32_t) CYHAL_SDIO_GOING_DOWN)))
                {
                    (void)(callback)(obj->callback_data.callback_arg, CYHAL_SDIO_GOING_DOWN);
                }

                wasCheckReadyExecuted = true;

                break;
            }

            case CY_SYSPM_BEFORE_TRANSITION:
            {
                /* Nothing to do in this mode */
                break;
            }

            case CY_SYSPM_AFTER_TRANSITION:
            case CY_SYSPM_CHECK_FAIL:
            {
                /* Execute this only if check ready case was executed */
                if (wasCheckReadyExecuted)
                {
                    /* Execute callback to indicate that interface is coming up */
                    cyhal_sdio_event_callback_t callback = (cyhal_sdio_event_callback_t) obj->callback_data.callback;
                    if ((callback != NULL) && (0U != (obj->events & (uint32_t) CYHAL_SDIO_COMING_UP)))
                    {
                        (void)(callback)(obj->callback_data.callback_arg, CYHAL_SDIO_COMING_UP);
                    }

                    wasCheckReadyExecuted = false;
                }
                break;
            }

            default:
                break;
        }
    }

    return retVal;
}


static cy_en_sd_host_bus_width_t convert_buswidth(uint8_t stopbits)
{
    switch (stopbits)
    {
        case 1:
            return CY_SD_HOST_BUS_WIDTH_1_BIT;
        case 4:
            return CY_SD_HOST_BUS_WIDTH_4_BIT;
        case 8:
            return CY_SD_HOST_BUS_WIDTH_8_BIT;
        default:
            CY_ASSERT(false);
            return CY_SD_HOST_BUS_WIDTH_1_BIT;
    }
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SdCardChangeClock
****************************************************************************//**
*
*  Changes the Host controller SD clock.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param instance_num
*     The SD host instance number.
*
* \param frequency
*     The frequency in Hz.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
static cy_en_sd_host_status_t Cy_SD_Host_SdCardChangeClock(SDHC_Type *base, uint32_t instance_num, uint32_t frequency)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    uint32_t clockInput = 0;
    
    cy_rslt_t get_frequency_result = 
    cyhal_system_clock_get_frequency(CYHAL_SDHC_HF_CLOCKS[instance_num], &clockInput);

