ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cyhal_sdhc.c
    cyhal_gpio_t data[8];
    data[0] = data0;
    data[1] = data1;
    data[2] = data2;
    data[3] = data3;
    data[4] = data4;
    data[5] = data5;
    data[6] = data6;
    data[7] = data7;

    /* Reserve SDHC */
    const cyhal_resource_pin_mapping_t *map = CY_UTILS_GET_RESOURCE(cmd, cyhal_pin_map_sdhc_card_cmd);

    if (NULL == map || NC == data0)
    {
        result = CYHAL_SDHC_RSLT_ERR_PIN;
    }

    /* Reserve and configure GPIO pins */
    if (result == CY_RSLT_SUCCESS)
    {
        result = setup_pin(
            cmd, cyhal_pin_map_sdhc_card_cmd, COUNT(cyhal_pin_map_sdhc_card_cmd), &(obj->pin_cmd));
    }

    if (result == CY_RSLT_SUCCESS)
    {
        result = setup_pin(
            clk, cyhal_pin_map_sdhc_clk_card, COUNT(cyhal_pin_map_sdhc_clk_card), &(obj->pin_clk));
    }

    for (uint8_t i = 0; (i < 4) && (CY_RSLT_SUCCESS == result); i++)
    {
        if (NC != data[i])
        {
            result = setup_pin(data[i], cyhal_pin_map_sdhc_card_dat_3to0, COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data[i]));
        }
    }

#if DATA8_PRESENT
    for (uint8_t i = 4; (i < 8) && (CY_RSLT_SUCCESS == result); i++)
    {
        if (NC != data[i])
        {
            result = setup_pin(data[i], cyhal_pin_map_sdhc_card_dat_7to4, COUNT(cyhal_pin_map_sdhc_card_dat_7to4), &(obj->pin_data[i]));
        }
    }
#else
    if ((NC != data4 || NC != data5 || NC != data6 || NC != data7) && (CY_RSLT_SUCCESS == result))
    {
        result = CYHAL_SDHC_RSLT_ERR_PIN;
    }
#endif

    if ((NC != cardDetect) && (CY_RSLT_SUCCESS == result))
    {
#if CARD_DETECT_PRESENT
        result = setup_pin(cardDetect, cyhal_pin_map_sdhc_card_detect_n, 
                                       COUNT(cyhal_pin_map_sdhc_card_detect_n), &(obj->pin_cardDetect));
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != ioVoltSel) && (CY_RSLT_SUCCESS == result))
    {
#if IO_VOLT_SEL_PRESENT
        result = setup_pin(ioVoltSel, cyhal_pin_map_sdhc_io_volt_sel, 
                            COUNT(cyhal_pin_map_sdhc_io_volt_sel), &(obj->pin_ioVoltSel));
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != cardIfPwrEn) && (CY_RSLT_SUCCESS == result))
    {
#if CARD_IF_PWR_EN_PRESENT
        result = setup_pin(cardIfPwrEn, cyhal_pin_map_sdhc_card_if_pwr_en, 
                            COUNT(cyhal_pin_map_sdhc_card_if_pwr_en), &(obj->pin_cardIfPwrEn));
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != cardMechWriteProt) && (CY_RSLT_SUCCESS == result))
    {
#if CARD_WRITE_PROT_PRESENT
        result = setup_pin(cardMechWriteProt, cyhal_pin_map_sdhc_card_mech_write_prot, 
                            COUNT(cyhal_pin_map_sdhc_card_mech_write_prot), &(obj->pin_cardMechWriteProt));
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != ledCtrl) && (CY_RSLT_SUCCESS == result))
    {
#if LED_CTRL_PRESENT
        result = setup_pin(ledCtrl, cyhal_pin_map_sdhc_led_ctrl, 
                            COUNT(cyhal_pin_map_sdhc_led_ctrl), &(obj->pin_ledCtrl));
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != cardEmmcReset) && (CY_RSLT_SUCCESS == result))
    {
#if CARD_EMMC_RESET_PRESENT
        result = setup_pin(cardEmmcReset, cyhal_pin_map_sdhc_card_emmc_reset_n, 
                            COUNT(cyhal_pin_map_sdhc_card_emmc_reset_n), &(obj->pin_cardEmmcReset));
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if (CY_RSLT_SUCCESS == result)
    {
        obj->resource = *map->inst;
        result = cyhal_hwmgr_reserve(&obj->resource);

        if (CY_RSLT_SUCCESS == result)
        {
            obj->base = CYHAL_SDHC_BASE_ADDRESSES[obj->resource.block_num];

            /* Enable the SDHC block */
            Cy_SD_Host_Enable(obj->base);

            /* Do not support eMMC card */
            obj->emmc = config->isEmmc;
            obj->dmaType = CY_SD_HOST_DMA_SDMA;

            /* Configure SD Host to operate */
            cy_stc_sd_host_init_config_t hostConfig;
            hostConfig.dmaType = obj->dmaType;
            hostConfig.emmc = obj->emmc;

        #if LED_CTRL_PRESENT
            if (NC != ledCtrl)
            {
                hostConfig.enableLedControl = true;
            }
            else
        #endif
            {
                hostConfig.enableLedControl = false;
            }

            obj->context.cardType = CY_SD_HOST_NOT_EMMC;

            obj->irq_cause = 0UL;
            obj->callback_data.callback = NULL;
            obj->callback_data.callback_arg = NULL;
            cyhal_sd_config_structs[obj->resource.block_num] = obj;

            IRQn_Type irqn = CYHAL_SDHC_IRQ_N[obj->resource.block_num];
            cy_stc_sysint_t irqCfg = { irqn, CYHAL_ISR_PRIORITY_DEFAULT };
            Cy_SysInt_Init(&irqCfg, cyhal_sdhc_irq_handler);
            NVIC_EnableIRQ(irqn);
            
            result = (cy_rslt_t) Cy_SD_Host_Init(obj->base, &hostConfig, &obj->context);
        }

        /* Initialize card */
        if (result == CY_RSLT_SUCCESS)
        {
            cy_stc_sd_host_sd_card_config_t stcSdcardCfg;
            cy_en_sd_host_card_capacity_t cardCapacity;
            uint32_t rca = 0UL;
            cy_en_sd_host_card_type_t cardType = CY_SD_HOST_UNUSABLE;

            /* Initialize the SDIO/SD/eMMC card configuration structure */
            stcSdcardCfg.lowVoltageSignaling = config->lowVoltageSignaling;
            stcSdcardCfg.busWidth = convert_buswidth(config->busWidth);
            stcSdcardCfg.cardType = &cardType;
            stcSdcardCfg.rca = &rca;
            stcSdcardCfg.cardCapacity = &cardCapacity;

            /* Initialize the card */
            result = (cy_rslt_t)Cy_SD_Host_InitCard(obj->base, &stcSdcardCfg, &obj->context);
            
            if (result == CY_RSLT_SUCCESS)
            {
                /* Update SD Card frequency to be 25 Mhz */
                result = (cy_rslt_t) Cy_SD_Host_SdCardChangeClock(obj->base, obj->resource.block_num, CY_SD_HOST_CLK_25M);
            }
        }
    }

    if (result != CY_RSLT_SUCCESS)
    {
        cyhal_sdhc_free(obj);
    }

    return result;
}

void cyhal_sdhc_free(cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);

    if ((NULL != obj->base) && (obj->resource.type != CYHAL_RSC_INVALID))
    {
        IRQn_Type irqn = CYHAL_SDHC_IRQ_N[obj->resource.block_num];
        NVIC_DisableIRQ(irqn);

        Cy_SD_Host_DeInit(obj->base);
        
        cyhal_hwmgr_free(&(obj->resource));
        obj->base = NULL;
        obj->resource.type = CYHAL_RSC_INVALID;
    }

    /* Free pins */
    release_pin_if_used(&obj->pin_cmd);
    release_pin_if_used(&obj->pin_clk);

#if DATA8_PRESENT
    const uint8_t max_idx = 8;
#else
    const uint8_t max_idx = 4;
#endif
    for (uint8_t i = 0; i < max_idx; i++)
    {
        release_pin_if_used(&obj->pin_data[i]);
    }

#if CARD_DETECT_PRESENT
    release_pin_if_used(&obj->pin_cardDetect);
#endif

#if IO_VOLT_SEL_PRESENT
    release_pin_if_used(&obj->pin_ioVoltSel);
#endif

