ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cyhal_sdhc.c
    if (CY_SD_HOST_SUCCESS != driverRet)
    {
        ret = CY_RSLT_TYPE_ERROR;
    }

    return ret;
}

void cyhal_sdhc_register_callback(cyhal_sdhc_t *obj, cyhal_sdhc_event_callback_t callback, void *callback_arg)
{
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->callback_data.callback = (cy_israddress) callback;
    obj->callback_data.callback_arg = callback_arg;
    cyhal_system_critical_section_exit(savedIntrStatus);
}

void cyhal_sdhc_enable_event(cyhal_sdhc_t *obj, cyhal_sdhc_event_t event, uint8_t intrPriority, bool enable)
{
    const uint8_t eventCount = 12;
    const uint32_t eventMap[12][2] =
    {
        { (uint32_t)CYHAL_SDHC_CMD_COMPLETE,    (uint32_t)CY_SD_HOST_CMD_COMPLETE},
        { (uint32_t)CYHAL_SDHC_XFER_COMPLETE,   (uint32_t)CY_SD_HOST_XFER_COMPLETE },
        { (uint32_t)CYHAL_SDHC_BGAP_EVENT,      (uint32_t)CY_SD_HOST_BGAP },
        { (uint32_t)CYHAL_SDHC_DMA_INTERRUPT,   (uint32_t)CY_SD_HOST_DMA_INTERRUPT },
        { (uint32_t)CYHAL_SDHC_BUF_WR_READY,    (uint32_t)CY_SD_HOST_BUF_WR_READY },
        { (uint32_t)CYHAL_SDHC_BUF_RD_READY,    (uint32_t)CY_SD_HOST_BUF_RD_READY },
        { (uint32_t)CYHAL_SDHC_CARD_INSERTION,  (uint32_t)CY_SD_HOST_CARD_INSERTION },
        { (uint32_t)CYHAL_SDHC_CARD_REMOVAL,    (uint32_t)CY_SD_HOST_CARD_REMOVAL },
        { (uint32_t)CYHAL_SDHC_CARD_INTERRUPT,  (uint32_t)CY_SD_HOST_CARD_INTERRUPT },
        { (uint32_t)CYHAL_SDHC_FX_EVENT,        (uint32_t)CY_SD_HOST_FX_EVENT },
        { (uint32_t)CYHAL_SDHC_CQE_EVENT,       (uint32_t)CY_SD_HOST_CQE_EVENT },
        { (uint32_t)CYHAL_SDHC_ERR_INTERRUPT,   (uint32_t)CY_SD_HOST_ERR_INTERRUPT },
    };

    uint32_t interruptMask;
    uint32_t interruptEnable;

    interruptEnable = Cy_SD_Host_GetNormalInterruptEnable(obj->base);
    interruptMask = Cy_SD_Host_GetNormalInterruptMask(obj->base);

    IRQn_Type irqn = CYHAL_SDHC_IRQ_N[obj->resource.block_num];
    NVIC_SetPriority(irqn, intrPriority);

    if(enable == true)
    {
        obj->irq_cause |= event;

        /* Enable specific interrupt */
        if((uint32_t) event < (uint32_t) CYHAL_SDHC_ALL_INTERRUPTS)
        {
            for (int i = 0; i < eventCount; i++)
            {
                const uint32_t *map_entry = eventMap[i];
                if ((map_entry[0] & obj->irq_cause) > 0)
                {
                    interruptEnable |= map_entry[1];
                    interruptMask   |= map_entry[1];
                }
            }
        }
        /* Enable all interrupts */
        else
        {
            interruptEnable = SDIO_ALL_INTERRUPTS_ENABLE_MASK;
            interruptMask = SDIO_SET_ALL_INTERRUPTS_MASK;
            obj->irq_cause = (uint32_t) CYHAL_SDHC_ALL_INTERRUPTS;
        }
    }
    /* Disable interrupt */
    else
    {
        obj->irq_cause &= ~event;

        if((uint32_t) event < (uint32_t) CYHAL_SDHC_ALL_INTERRUPTS)
        {
            for (int i = 0; i < eventCount; i++)
            {
                const uint32_t *map_entry = eventMap[i];
                if ((map_entry[0] & obj->irq_cause) > 0)
                {
                    interruptEnable &= ~map_entry[1];
                    interruptMask   &= ~map_entry[1];
                }
            }
        }
        /* Disable all interrupts */
        else
        {
            interruptEnable = SDIO_CLEAR_ALL_INTERRUPTS_ENABLE_MASK;
            interruptMask = SDIO_CLEAR_ALL_INTERRUPTS_MASK;
            obj->irq_cause = 0u;
        }
    }

    Cy_SD_Host_SetNormalInterruptMask(obj->base, interruptMask);
    Cy_SD_Host_SetNormalInterruptEnable(obj->base, interruptEnable);
}

static void cyhal_sdio_irq_handler()
{
    IRQn_Type irqn = CYHAL_GET_CURRENT_IRQN();
    uint8_t block = cyhal_sd_get_block_from_irqn(irqn);
    SDHC_Type *blockAddr = CYHAL_SDHC_BASE_ADDRESSES[block];
    cyhal_sdio_t *obj = (cyhal_sdio_t*) cyhal_sd_config_structs[block];

    uint32_t interruptStatus = Cy_SD_Host_GetNormalInterruptStatus(blockAddr);
    uint32_t userInterruptStatus = interruptStatus & obj->irq_cause;

    if (obj->callback_data.callback != NULL && userInterruptStatus > 0)
    {
        cyhal_sdio_event_callback_t callback = (cyhal_sdio_event_callback_t) obj->callback_data.callback;
        /* Call registered callbacks here */
        (void)(callback)(obj->callback_data.callback_arg, (cyhal_sdio_irq_event_t) userInterruptStatus);
    }

    /* Clear only handled events */
    Cy_SD_Host_ClearNormalInterruptStatus(blockAddr, userInterruptStatus);

    /* To clear SD Card interrupt need to disable SD Card Interrupt Enable bit.
    *  The SD Card interrupt is enabled in the bulk transfer function later on
    *  the next data transfer.
    */
    if (0U != (obj->irq_cause & CY_SD_HOST_CARD_INTERRUPT))
    {
        if (0U != (interruptStatus & CY_SD_HOST_CARD_INTERRUPT))
        {
            uint32_t interruptMask = Cy_SD_Host_GetNormalInterruptEnable(blockAddr);
            interruptMask &= (uint32_t) ~CY_SD_HOST_CARD_INTERRUPT;

            /* Disable SD Card interrupt */
            Cy_SD_Host_SetNormalInterruptEnable(blockAddr, interruptMask);
        }
    }
}

cy_rslt_t cyhal_sdio_init(cyhal_sdio_t *obj, cyhal_gpio_t cmd, cyhal_gpio_t clk, cyhal_gpio_t data0, cyhal_gpio_t data1, cyhal_gpio_t data2, cyhal_gpio_t data3)
{
    cy_stc_sd_host_init_config_t hostConfig;
    cy_rslt_t result;
    cy_stc_sd_host_context_t context;

    CY_ASSERT(NULL != obj);

    obj->resource.type = CYHAL_RSC_INVALID;
    obj->base = NULL;

    result = setup_pin(
        cmd, cyhal_pin_map_sdhc_card_cmd, COUNT(cyhal_pin_map_sdhc_card_cmd), &(obj->pin_cmd));

    if (CY_RSLT_SUCCESS == result)
    {
        result = setup_pin(
            clk, cyhal_pin_map_sdhc_clk_card, COUNT(cyhal_pin_map_sdhc_clk_card), &(obj->pin_clk));
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = setup_pin(
            data0, cyhal_pin_map_sdhc_card_dat_3to0, COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data0));
    }
    
    if (CY_RSLT_SUCCESS == result)
    {
        result = setup_pin(
            data1, cyhal_pin_map_sdhc_card_dat_3to0, COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data1));
    }
    
    if (CY_RSLT_SUCCESS == result)
    {
        result = setup_pin(
            data2, cyhal_pin_map_sdhc_card_dat_3to0, COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data2));
    }
    
    if (CY_RSLT_SUCCESS == result)
    {
        result = setup_pin(
            data3, cyhal_pin_map_sdhc_card_dat_3to0, COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data3));
    }

    if (result == CY_RSLT_SUCCESS)
    {
        const cyhal_resource_pin_mapping_t *cmd_map = CY_UTILS_GET_RESOURCE(cmd, cyhal_pin_map_sdhc_card_cmd);
        cyhal_resource_inst_t sdhc = *cmd_map->inst;

        result = cyhal_hwmgr_reserve(&sdhc);
        if (result == CY_RSLT_SUCCESS)
        {
            obj->resource = sdhc;
            
            if (result == CY_RSLT_SUCCESS)
            {
                obj->base = CYHAL_SDHC_BASE_ADDRESSES[obj->resource.block_num];

                /* Enable the SDHC block */
                Cy_SD_Host_Enable(obj->base);

                hostConfig.dmaType = CY_SD_HOST_DMA_SDMA;
                hostConfig.emmc = false;
                hostConfig.enableLedControl = false;
                context.cardType = CY_SD_HOST_SDIO;

                /* Configure SD Host to operate */
                (void) Cy_SD_Host_Init(obj->base, &hostConfig, &context);

                /* Register SDIO Deep Sleep Callback */
                obj->pm_params.base = obj->base;
                obj->pm_params.context = obj;

