ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cyhal_sdhc.c
                obj->pm_callback.callback = &cyhal_sdio_syspm_callback;
                obj->pm_callback.type = CY_SYSPM_DEEPSLEEP;
                obj->pm_callback.skipMode = 0;
                obj->pm_callback.callbackParams = &(obj->pm_params);
                obj->pm_callback.prevItm = NULL;
                obj->pm_callback.nextItm = NULL;

                if (result == CY_RSLT_SUCCESS)
                {
                    if (!Cy_SysPm_RegisterCallback(&(obj->pm_callback)))
                    {
                        result = CY_RSLT_TYPE_ERROR;
                    }
                }

                if (result == CY_RSLT_SUCCESS)
                {
                    /* Only enable the SDMA interrupt */
                    Cy_SD_Host_SetNormalInterruptMask(obj->base, CY_SD_HOST_DMA_INTERRUPT);

                    /* Don't enable any error interrupts for now */
                    Cy_SD_Host_SetErrorInterruptMask(obj->base, 0UL);

                    /* Clear all interrupts */
                    Cy_SD_Host_ClearErrorInterruptStatus(obj->base, SDIO_SET_ALL_INTERRUPTS_MASK);
                    Cy_SD_Host_ClearNormalInterruptStatus(obj->base, SDIO_SET_ALL_INTERRUPTS_MASK);

                    obj->irq_cause = 0UL;
                    obj->events    = 0UL;

                    obj->callback_data.callback = NULL;
                    obj->callback_data.callback_arg = NULL;
                    cyhal_sd_config_structs[obj->resource.block_num] = obj;

                    IRQn_Type irqn = CYHAL_SDHC_IRQ_N[obj->resource.block_num];
                    cy_stc_sysint_t irqCfg = { irqn, CYHAL_ISR_PRIORITY_DEFAULT };
                    Cy_SysInt_Init(&irqCfg, cyhal_sdio_irq_handler);
                    NVIC_EnableIRQ(irqn);

                    (void)Cy_SD_Host_SetHostBusWidth(obj->base, CY_SD_HOST_BUS_WIDTH_4_BIT);

                    /* Change the host SD clock to 400 kHz */
                    (void) Cy_SD_Host_SdCardChangeClock(obj->base, obj->resource.block_num, SDIO_HOST_CLK_400K);

                    obj->frequencyhal_hz = SDIO_HOST_CLK_400K;
                    obj->block_size = SDIO_64B_BLOCK;
                }
            }
        }
    }

    if (result != CY_RSLT_SUCCESS)
    {
        cyhal_sdio_free(obj);
    }

    return result;
}

void cyhal_sdio_free(cyhal_sdio_t *obj)
{
    CY_ASSERT(NULL != obj);

    if ((NULL != obj->base) && (obj->resource.type != CYHAL_RSC_INVALID))
    {
        IRQn_Type irqn = CYHAL_SDHC_IRQ_N[obj->resource.block_num];
        NVIC_DisableIRQ(irqn);

        Cy_SD_Host_DeInit(obj->base);

        cyhal_hwmgr_free(&(obj->resource));
        obj->base = NULL;
        obj->resource.type = CYHAL_RSC_INVALID;

        /* Unregister SDIO Deep Sleep Callback */
        (void)Cy_SysPm_UnregisterCallback(&(obj->pm_callback));
    }

    /* Free pins */
    release_pin_if_used(&obj->pin_clk);
    release_pin_if_used(&obj->pin_cmd);
    release_pin_if_used(&obj->pin_data0);
    release_pin_if_used(&obj->pin_data1);
    release_pin_if_used(&obj->pin_data2);
    release_pin_if_used(&obj->pin_data3);
}


cy_rslt_t cyhal_sdio_configure(cyhal_sdio_t *obj, const cyhal_sdio_cfg_t *config)
{
    cy_en_sd_host_status_t result = CY_SD_HOST_ERROR_TIMEOUT;

    if ((NULL == obj) && (config == NULL))
    {
        return CYHAL_SDIO_RSLT_ERR_BAD_PARAM;
    }

    if (config->frequencyhal_hz != 0U)
    {
        result = Cy_SD_Host_SdCardChangeClock(obj->base, obj->resource.block_num, config->frequencyhal_hz);
        obj->frequencyhal_hz = config->frequencyhal_hz;
    }

    if (config->block_size != 0U)
    {
        /* No need to change anything in HW, because it will be overwritten
        *  in cyhal_sdio_bulk_transfer()/cyhal_sdio_transfer_async() functions.
        *  The HW block size will taken based on obj->block_size, which is
        *  updated here.
        */
        obj->block_size = config->block_size;
    }

    return result;
}

/*******************************************************************************
* Note that during this function execution the CY_SD_HOST_CMD_COMPLETE
* interrupt is disabled.
*******************************************************************************/
cy_rslt_t cyhal_sdio_send_cmd(const cyhal_sdio_t *obj, cyhal_transfer_t direction, \
                              cyhal_sdio_command_t command, uint32_t argument, uint32_t* response)
{
    if (NULL == obj)
    {
        return CYHAL_SDIO_RSLT_ERR_BAD_PARAM;
    }

    cy_rslt_t                   ret = CY_RSLT_SUCCESS;
    cy_en_sd_host_status_t      result = CY_SD_HOST_ERROR_TIMEOUT;
    cy_stc_sd_host_cmd_config_t cmd;
    uint32_t                    retry = SDIO_TRANSF_TRIES;
    uint32_t                    regIntrSts = Cy_SD_Host_GetNormalInterruptMask(obj->base);

    /* Clear out the response */
    if ( response != NULL )
    {
        *response = 0UL;
    }

    while ((CY_SD_HOST_SUCCESS != result) && (retry-- > 0UL))
    {
        /* First clear out the command complete and transfer complete statuses */
        Cy_SD_Host_ClearNormalInterruptStatus(obj->base, CY_SD_HOST_CMD_COMPLETE);

        /* Disable CMD Done interrupt, will be enabled after transition is complete */
        Cy_SD_Host_SetNormalInterruptMask(obj->base, (regIntrSts & (uint16_t)~CY_SD_HOST_CMD_COMPLETE));

        /* Check if an error occurred on any previous transactions */
        if( Cy_SD_Host_GetNormalInterruptStatus(obj->base) & CY_SD_HOST_ERR_INTERRUPT )
        {
            /* Reset the block if there was an error. Note a full reset usually
             * requires more time, but this short version is working quite well and
             * successfully clears out the error state.
             */
            Cy_SD_Host_ClearErrorInterruptStatus(obj->base, SDIO_SET_ALL_INTERRUPTS_MASK);
            Cy_SD_Host_SoftwareReset(obj->base, CY_SD_HOST_RESET_CMD_LINE);
            Cy_SD_Host_SoftwareReset(obj->base, CY_SD_HOST_RESET_DATALINE);
            Cy_SysLib_DelayUs(1);
            obj->base->CORE.SW_RST_R = 0U;
        }

